weaver/socialnetwork/evaluation/gcp/2024-08-13_02:28:04/workload.out
Running 5m test @ http://34.159.118.175:12345/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 14.450ms, rate sampling interval: 40ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    17.79ms    9.88ms  39.71ms   94.69%
    Req/Sec     9.99     15.35    51.00     94.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.77ms
 75.000%   19.23ms
 90.000%   23.77ms
 99.000%   39.71ms
 99.900%  184.70ms
 99.990%  225.66ms
 99.999%  225.66ms
100.000%  225.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.975     0.000000            1         1.00
      12.975     0.100000          291         1.11
      13.607     0.200000          580         1.25
      14.183     0.300000          866         1.43
      14.855     0.400000         1157         1.67
      15.767     0.500000         1441         2.00
      16.351     0.550000         1586         2.22
      16.927     0.600000         1733         2.50
      17.631     0.650000         1875         2.86
      18.335     0.700000         2019         3.33
      19.231     0.750000         2164         4.00
      19.695     0.775000         2235         4.44
      20.159     0.800000         2308         5.00
      20.623     0.825000         2379         5.71
      21.391     0.850000         2450         6.67
      22.207     0.875000         2523         8.00
      22.847     0.887500         2559         8.89
      23.775     0.900000         2595        10.00
      24.671     0.912500         2630        11.43
      25.487     0.925000         2666        13.33
      26.607     0.937500         2702        16.00
      27.407     0.943750         2720        17.78
      28.095     0.950000         2738        20.00
      29.231     0.956250         2756        22.86
      30.207     0.962500         2774        26.67
      31.087     0.968750         2792        32.00
      31.407     0.971875         2801        35.56
      31.903     0.975000         2810        40.00
      33.151     0.978125         2819        45.71
      34.079     0.981250         2828        53.33
      34.559     0.984375         2837        64.00
      36.127     0.985938         2842        71.11
      37.343     0.987500         2846        80.00
      39.007     0.989062         2851        91.43
      40.575     0.990625         2855       106.67
      44.159     0.992188         2860       128.00
      45.503     0.992969         2862       142.22
      46.111     0.993750         2864       160.00
      49.599     0.994531         2867       182.86
      50.015     0.995313         2869       213.33
      53.119     0.996094         2871       256.00
      59.391     0.996484         2872       284.44
      65.727     0.996875         2873       320.00
      73.983     0.997266         2875       365.71
      90.431     0.997656         2876       426.67
     162.175     0.998047         2877       512.00
     162.175     0.998242         2877       568.89
     184.063     0.998437         2878       640.00
     184.703     0.998633         2879       731.43
     184.703     0.998828         2879       853.33
     187.263     0.999023         2880      1024.00
     187.263     0.999121         2880      1137.78
     187.263     0.999219         2880      1280.00
     221.695     0.999316         2881      1462.86
     221.695     0.999414         2881      1706.67
     221.695     0.999512         2881      2048.00
     221.695     0.999561         2881      2275.56
     221.695     0.999609         2881      2560.00
     225.663     0.999658         2882      2925.71
     225.663     1.000000         2882          inf
#[Mean    =       17.789, StdDeviation   =        9.876]
#[Max     =      225.536, Total count    =         2882]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3000 requests in 5.00m, 1.67MB read
Requests/sec:     10.00
Transfer/sec:      5.69KB
